
## Plan Result

[CI link](https://github.com/hawk0616/recruit-service-board-infla/actions/runs/6239219876)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * aws_db_instance.my_db_instance
  * aws_db_subnet_group.my_db_subnet_group
  * aws_subnet.rds_subnet_a
  * aws_subnet.rds_subnet_d
* Delete
  * aws_subnet.rds_subnet


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_db_instance.my_db_instance will be created
  + resource "aws_db_instance" "my_db_instance" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "mydb"
      + db_subnet_group_name                  = "recruit-service-board-db-subnet-group"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "5.7"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.mysql5.7"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags                                  = {
          + "Name" = "recruit-service-board RDS Instance"
        }
      + tags_all                              = {
          + "Name" = "recruit-service-board RDS Instance"
        }
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = [
          + "sg-01d224fac4c4d51f5",
        ]
    }

  # aws_db_subnet_group.my_db_subnet_group will be created
  + resource "aws_db_subnet_group" "my_db_subnet_group" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "recruit-service-board-db-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "recruit-service-board-db-subnet-group"
        }
      + tags_all                = {
          + "Name" = "recruit-service-board-db-subnet-group"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_subnet.rds_subnet will be destroyed
  # (because aws_subnet.rds_subnet is not in configuration)
  - resource "aws_subnet" "rds_subnet" {
      - arn                                            = "arn:aws:ec2:ap-northeast-1:113713103169:subnet/subnet-0b82a1db37327b596" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-northeast-1d" -> null
      - availability_zone_id                           = "apne1-az2" -> null
      - cidr_block                                     = "10.0.3.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0b82a1db37327b596" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "113713103169" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "MapPublicIpOnLaunch" = "false"
          - "Name"                = "recruit-service-board RDS Private Subnet 1d"
          - "Type"                = "rds"
        } -> null
      - tags_all                                       = {
          - "MapPublicIpOnLaunch" = "false"
          - "Name"                = "recruit-service-board RDS Private Subnet 1d"
          - "Type"                = "rds"
        } -> null
      - vpc_id                                         = "vpc-06a74de91e584f523" -> null
    }

  # aws_subnet.rds_subnet_a will be created
  + resource "aws_subnet" "rds_subnet_a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "MapPublicIpOnLaunch" = "false"
          + "Name"                = "recruit-service-board RDS Private Subnet 1a"
          + "Type"                = "rds"
        }
      + tags_all                                       = {
          + "MapPublicIpOnLaunch" = "false"
          + "Name"                = "recruit-service-board RDS Private Subnet 1a"
          + "Type"                = "rds"
        }
      + vpc_id                                         = "vpc-06a74de91e584f523"
    }

  # aws_subnet.rds_subnet_d will be created
  + resource "aws_subnet" "rds_subnet_d" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "MapPublicIpOnLaunch" = "false"
          + "Name"                = "recruit-service-board RDS Private Subnet 1d"
          + "Type"                = "rds"
        }
      + tags_all                                       = {
          + "MapPublicIpOnLaunch" = "false"
          + "Name"                = "recruit-service-board RDS Private Subnet 1d"
          + "Type"                = "rds"
        }
      + vpc_id                                         = "vpc-06a74de91e584f523"
    }

Plan: 4 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":13,"Program":"tfcmt","SHA1":"d28e44d990eacbff5177dd983af660b95e260914","Vars":{},"WorkflowName":"Terraform"} -->